### Output
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```Terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_key_vault.vault will be updated in-place
  ~ resource "azurerm_key_vault" "vault" {
      ~ access_policy                   = [
          ~ {
              ~ object_id               = "445c1f94-d94f-49e6-8883-2eb0ebaa60de" -> "550e8400-e29b-41d4-a716-446655440000"
                # (6 unchanged attributes hidden)
            },
        ]
        id                              = "/subscriptions/8f8d6d66-dc06-459a-b140-3de74e5f2fe5/resourceGroups/rg-pd-todo-dev/providers/Microsoft.KeyVault/vaults/kvk-pd-todo-dev"
        name                            = "kvk-pd-todo-dev"
        tags                            = {
            "azd-env-name" = "dev"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_mssql_database.db will be created
  + resource "azurerm_mssql_database" "db" {
      + auto_pause_delay_in_minutes         = 60
      + collation                           = (known after apply)
      + create_mode                         = "Default"
      + creation_source_database_id         = (known after apply)
      + geo_backup_enabled                  = true
      + id                                  = (known after apply)
      + ledger_enabled                      = (known after apply)
      + license_type                        = (known after apply)
      + maintenance_configuration_name      = (known after apply)
      + max_size_gb                         = (known after apply)
      + min_capacity                        = 0.5
      + name                                = "todo"
      + read_replica_count                  = (known after apply)
      + read_scale                          = (known after apply)
      + restore_point_in_time               = (known after apply)
      + sample_name                         = (known after apply)
      + server_id                           = "/subscriptions/8f8d6d66-dc06-459a-b140-3de74e5f2fe5/resourceGroups/rg-pd-todo-dev/providers/Microsoft.Sql/servers/sql-pd-todo-dev"
      + sku_name                            = "GP_S_Gen5_1"
      + storage_account_type                = "Geo"
      + tags                                = {
          + "azd-env-name" = "dev"
        }
      + transparent_data_encryption_enabled = true
      + zone_redundant                      = false
    }

  # module.api.azurerm_linux_function_app.apiapp will be updated in-place
  ~ resource "azurerm_linux_function_app" "apiapp" {
      ~ app_settings                      = {
          + "FUNCTIONS_EXTENSION_VERSION" = "~4"
            # (4 unchanged elements hidden)
        }
        id                                = "/subscriptions/8f8d6d66-dc06-459a-b140-3de74e5f2fe5/resourceGroups/rg-pd-todo-dev/providers/Microsoft.Web/sites/app-pd-todo-api-dev"
        name                              = "app-pd-todo-api-dev"
        tags                              = {
            "azd-env-name"     = "dev"
            "azd-service-name" = "api"
        }
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.api.azurerm_service_plan.apiapp_serviceplan will be updated in-place
  ~ resource "azurerm_service_plan" "apiapp_serviceplan" {
        id                           = "/subscriptions/8f8d6d66-dc06-459a-b140-3de74e5f2fe5/resourceGroups/rg-pd-todo-dev/providers/Microsoft.Web/serverfarms/plan-pd-todo-dev"
        name                         = "plan-pd-todo-dev"
      ~ tags                         = {
            "azd-env-name"     = "dev"
          - "azd-service-name" = "api" -> null
        }
        # (10 unchanged attributes hidden)
    }

  # module.api.azurerm_storage_account.apiapp_storage will be updated in-place
  ~ resource "azurerm_storage_account" "apiapp_storage" {
        id                                = "/subscriptions/8f8d6d66-dc06-459a-b140-3de74e5f2fe5/resourceGroups/rg-pd-todo-dev/providers/Microsoft.Storage/storageAccounts/stpdtododev"
        name                              = "stpdtododev"
      ~ tags                              = {
            "azd-env-name"     = "dev"
          - "azd-service-name" = "api" -> null
        }
        # (37 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.azurerm_user_assigned_identity.applicationIdentity will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "applicationIdentity" {
        id                  = "/subscriptions/8f8d6d66-dc06-459a-b140-3de74e5f2fe5/resourceGroups/rg-pd-todo-dev/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pd-todo-dev"
        name                = "pd-todo-dev"
      ~ tags                = {
            "azd-env-name"     = "dev"
          - "azd-service-name" = "api" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.web.azurerm_static_site.web will be updated in-place
  ~ resource "azurerm_static_site" "web" {
        id                  = "/subscriptions/8f8d6d66-dc06-459a-b140-3de74e5f2fe5/resourceGroups/rg-pd-todo-dev/providers/Microsoft.Web/staticSites/app-pd-todo-static-dev"
        name                = "app-pd-todo-static-dev"
      ~ tags                = {
            "azd-env-name"     = "dev"
          - "azd-service-name" = "web" -> null
        }
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 6 to change, 0 to destroy.

```

</details>

*Pusher: @nigelhamer, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform plan`*